Documents/ВыдачаДисконтныйКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ВыдачаДисконтныйКарт</Name>
			<BasedOn>
				<xr:Item>Document.Запрос</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркетинговаяКампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаСделку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСделку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгодоприобретатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID_Взаимодействия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыдачаДисконтныйКарт/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Запрос") Тогда
		Запрос = ДанныеЗаполнения;
		ДанныеЗапроса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Проект, Клиент");
		Проект = ДанныеЗапроса.Проект;
		Получатель = ДанныеЗапроса.Клиент;
		Выгодоприобретатель = ДанныеЗапроса.Клиент;
		Ответственный = Пользователи.ТекущийПользователь();
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Запрос = ДанныеЗаполнения.Запрос;
		ДанныеЗапроса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения.Запрос, "Проект, Клиент");
		Проект = ДанныеЗапроса.Проект;
		Если ДанныеЗаполнения.Свойство("Получатель") Тогда
			Получатель = ДанныеЗаполнения.Получатель;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Выгодоприобретатель") Тогда
			Выгодоприобретатель = ДанныеЗаполнения.Выгодоприобретатель;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Получатель) Тогда
			Получатель = ДанныеЗапроса.Клиент;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Выгодоприобретатель) Тогда
			Выгодоприобретатель = ДанныеЗапроса.Клиент;
		КонецЕсли;		
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры
